{"data":{"allMarkdownRemark":{"nodes":[{"frontmatter":{"title":"Do I need to attract referrals?","tags":"ref-1"},"html":"<p>Although the basis of the system is to build a structure from referrals, and referrals are the source of your profit, an interesting fact is that referrals are NOT REQUIRED.</p>\n<p>In addition to the invitation,you can get referrals in two more ways: \"Overflows\" and \"Free referrals\". For each of these methods, read below in the following paragraphs.</p>"},{"frontmatter":{"title":"How many referrals can I invite, and how are they distributed?","tags":"ref-2"},"html":"<p>Personally, you can only invite 3 referrals, which are attached directly to you and are called \"referrals of the 1st line\".</p>\n<p>3 of your 1st line referrals (personally invited by You) also invite 3 of their referrals. These 9 participants in your structure are \"referrals of the 2nd line\".</p>\n<p>Then, by analogy, you have 27 referrals of the 3rd line and 81 referrals of the 4th line.</p>\n<p>If you continue to invite referrals when you already have 3, then subsequent referrals are attached to the depth of your structure and become your referrals of the 2nd, 3rd and 4th lines. This is called \"overflow\".\nMore about \"overflow\" you can see in the next paragraph \"What is \"overflow \"?\".</p>"},{"frontmatter":{"title":"What is \"Overflow\"?","tags":"ref-3"},"html":"<p>Overflow is the method of obtaining referrals from your uplines of all lines, at which, when filling all free slots with 3 referrals, the next goes to their referral by \"overflow\", that means to you.</p>\n<p>Example: Your 1st line upline (your inviter to the system) invited three referrals, and continued to invite further, or did not immediately stop advertising. The fourth referral \"overflow\" to you, means attached to you.\nIf you have already filled all three slots with referrals, then they also \"overflow \" go even lower and attach to your referrals, becoming your second line referrals.</p>\n<p><code>Note</code>. Overflows fill not only all your 4 lines completely, but also go down below additionally to your 5th line, filling 243 more slots in addition to your structure from 120 referrals on all 4 lines.\nAfter the 5th line the gas amount become more than payment amount. And even further, the overflows are limited by the Ethereum cryptocurrency itself, since the maximum possible limit of Ethereum gas is 8000000. Therefore, infinit overflows by the smart contract are impossible by definition.</p>"},{"frontmatter":{"title":"To what line do the \"Overflows \" work?","tags":"ref-4"},"html":"<p>Briefly:</p>\n<p>Without a site through a smart contract up to 5 lines inclusive\nThrough the site to the 8th line inclusive</p>\n<p>Detailed</p>\n<p>Through the CryptoHands main smart contract, overflows work not only up to 4 lines but additionally up to 5 in depth. This means that you can personally invite 363 participants. 363 is a theoretical number if none of the referrals invite anyone else, which is impossible in practice. During the invitation of 363 referrals personally the structure manages to grow to several thousand people and works by itself.\nOverflows are not infinit ONLY due to the limitations of the Ethereum cryptocurrency. If you make the overflow deeper than 5 lines, then the gas charge when sending a transaction will be comparable, and sometimes exceed the amount of the transfer, even if the transaction is rejected.</p>\n<p>When registering via the website cryptohands.org, overflows work up to 8 lines due to the additional smart contract wich was created to save gas and increase the depth of overflows.\nThrough the site you can personally invite up to 9840 people. If you personally invite 9840 people, then during the invitation, the structure will grow to 100,000 people and more at the expense of active participants.</p>"},{"frontmatter":{"title":"What is \"Free referrals\"?","tags":"ref-5"},"html":"<p>Free referrals are members of the system who have come for some reason WITHOUT a referral link.</p>\n<p>Free referrals are distributed evenly throughout the system, and starting with those uplines, who earlier registered in the system.</p>\n<p>IMPORTANT NOTE: Free referrals are distributed through the system NOT by a smart contract, but by the system of the site.\nThis is the ONLY thing that a smart contract does not make and that is why:\nIf free referrals were distributing by a smart contract, then with the growth of the System there would be huge calculations that would consume a huge amount of gas, which would not be beneficial for users.\nEverything else, including the \"overflow\", distributes by smart contract.</p>"},{"frontmatter":{"title":"Can I invite referrals by not buying the first level?","tags":"ref-6"},"html":"<p>You can, but they will become free referrals and get to other members of the system, not you. Since the system does't \"know\" you before you bought the 1st level.</p>"}]}}}