{"data":{"allMarkdownRemark":{"nodes":[{"frontmatter":{"title":"Has the helping system like CryptoLights been available before?","tags":"about-2"},"html":"<p>Answer: There is always a mutual help not only in people community, but also in animals. You will see most clearly in your family, your brothers, your family, neighbors and the community of your country and this happens around the world.</p>\n<p>There has been financial assistance like CryptoLights since the early 20th century, and the beginning of the 21st century thanks to the cryptocurrency, it has been made more robust than ever.</p>"},{"frontmatter":{"title":"What difference does it make with smart contract of CryptoLights?","tags":"about-3"},"html":"<p>The previous system with the disadvantages:</p>\n<ul>\n<li>Monetary limit in a country, ability to expand the community is not good.</li>\n<li>Website management focused on a group of people and they blocked the interests of members such as wallets or their participating money.</li>\n<li>Algorithms are constantly changing to create \"grouping benefits\" for a small community of them, who lose the trust of the \"BIG\" community.</li>\n<li>There is no repetition in a period of time available in their system as CryptoLights is 6 months.</li>\n<li>Website hacked or closed meaning people lose money. </li>\n</ul>\n<p>Smart Contract and Ethereum have solved all:</p>\n<ul>\n<li>There is no restriction in any community or country, just with the Internet, you can participate in this community no matter day or night.</li>\n<li>Smart Contract of CryptoLights is mounted on the 2nd largest Ethereum system in the world, it cannot be deleted or edited by an individual or an organization, so it cannot block the rights of participants or take their money. \"FAIR\" is really established.</li>\n<li>Be sure to understand CryptoLights' rules and commitment to voluntarily collaborate, afterwards these rules will not change with time and the BIG community will always have faith.</li>\n<li>After 6 months you will get a profit from the system you have created at CryptoLights and you will get a money from your re-participation like this.</li>\n<li>The website and smart contract of Cryptolights are completely independent. Though web is hacked, it is still okay because some one will remake a similar website to help the community access the cryptolights smart contract easily.</li>\n</ul>"},{"frontmatter":{"title":"Is this the first time in the world that has have a \"Fairness\" community supported by the Millionaires Cryto?","tags":"about-4"},"html":"<p>The meaning of \"CHARITY\" will be practical if it comes to the right people with \"FAIRNESS\" to everyone. If you try to help many people, there will be a money from Crypto millionaires to help you through the \"BONUS\" mechanism of CryptoLights. </p>\n<p>It does not matter if it is first system or not? It is important that it is \"FAIR\" and consistent so that everyone cooperates with the game rules. LET’S SPREAD THIS GOOD THING.</p>"},{"frontmatter":{"title":"How to \"START\" to earn money here?","tags":"about-5"},"html":"<ul>\n<li>Make sure you read the \"rules and regulations\" of the game. Accept it. </li>\n<li>Skim how it works at homepage. </li>\n<li>More details about How to do will be provided for readers.</li>\n</ul>"},{"frontmatter":{"title":"Does CryptoLights guarantee never to lock or block my account?","tags":"about-6"},"html":"<p>It would be a exaggeration  if we claim 100% that your account will not be blocked even though Ethreum's Smart Contract has been running long enough to ensure it is not broken. But we guarantee the smart contract of cryptolights on the ethereum network will not be lost (If you do this, read our \"CHALLENGE\" section to get 10,000 ETH for yourself). </p>\n<p>It is not too arrogant, but this will be the first time in the history that your account will not be blocked or locked by the administrator. You just need to make sure your wallet address is always accessible and not provide the private key of your wallet address to anyone who requests it including CryptoLights.</p>"},{"frontmatter":{"title":"Is the CryptoLights project legal?","tags":"about-7"},"html":"<p>Yes, you should remember when you read \"Rules and conventions\" before joining. No one REQUESTS you to transfer your money to anyone, every transaction is VOLUNTARY.</p>"},{"frontmatter":{"title":"Does CryptoLights Smart Contract hold money?","tags":"about-8"},"html":"<p>Almost with just a little knowledge of Ethereum, you can know right away, Smart contracts have \"balance\" which always equals to \"0\". The money transfer transactions are via the smart contract of CryptoLights and they only redirects almost immediately to the wallet of others in the community. Because of that BELIEF has been spreaded in the community.</p>"},{"frontmatter":{"title":"Just said so many good things, so is there any RISKS here?","tags":"about-9"},"html":"<p>We will tell you YES. If we don't have risks, it will be a\"EXAGGERATION\".</p>\n<ul>\n<li>No risk is from CryptoLights as it: Does not keep money of the community, only navigates to others.</li>\n<li>There is a risk here from YOUR side: That's when you join and no partners join below you, now you will take risk with initial 0.1ETH and remember that this is only risk. </li>\n<li>Do you DARE to accept this risk? Do you have enough love to give away to the community? Are you willing to lose 0.1ETH for a chance to receive more? It is up to your decision. </li>\n<li>But there's still a lot of fun ahead because you're not here alone, you have your upline and the system, there will be free referrals for you if you wait long enough.</li>\n</ul>\n<p>So the conclusion is risk here if YES is 0.1 ETH and NOT is \"0\".</p>"}]}}}